app/views/doc1s/index.html.erb

SELECT `doc1s`.* FROM `doc1s` WHERE `doc1s`.`tender_id` = 14
SELECT COUNT(*) FROM `doc1s` WHERE `doc1s`.`tender_id` = 19
---
<br />
<% if Doc1.where(tender_id: @tender.id).count == 0%>