app/helpers/application_helper.rb

	def find_department(doc)
		$department = User.where(id: Tender.where(id: doc.tender_id).select(:user_id)).pluck(:department).join
---
SELECT `tenders`.`user_id` FROM `tenders` WHERE `tenders`.`id` = 14 LIMIT 1
SELECT `users`.`id` FROM `users` WHERE `users`.`id` IN (SELECT `tenders`.`user_id` FROM `tenders` WHERE `tenders`.`id` = 14) LIMIT 1

	def get_ref_id(doc)
		Tender.where(id: doc.tender_id).pluck(:ref_id).join
---
SELECT `tenders`.`ref_id` FROM `tenders` WHERE `tenders`.`id` = 18