app/controllers/doc1s_controller.rb

  def create
    @doc1 = @tender.doc1s.build(doc1_params)

    if @doc1.save
---
INSERT INTO `doc1s` (`tender_id`, `debit_head`, `item_name`, `quantity`, `estimated_cost`, `created_at`, `updated_at`, `type_of_tender`) VALUES (1, 'tussu', 'chair', 5, 5000, '2020-01-14 10:59:16.022139', '2020-01-14 10:59:16.022139', 2)

  def update
    if @doc1.update_attributes(doc1_params)
---
UPDATE `doc1s` SET `doc1s`.`type_of_tender` = 2, `doc1s`.`updated_at` = '2019-12-24 18:17:18.378857' WHERE `doc1s`.`id` = 4

  def destroy
    @doc1.destroy
---
DELETE FROM `doc1s` WHERE `doc1s`.`id` = 1

    def set_tender
      @tender = Tender.find(params[:tender_id])
---
SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 19 LIMIT 1  [["id", 19], ["LIMIT", 1]]

    def set_doc1
      @doc1 = @tender.doc1s.find(params[:id])
---
SELECT `doc1s`.* FROM `doc1s` WHERE `doc1s`.`tender_id` = 19 AND `doc1s`.`id` = 4 LIMIT 1