app/controllers/doc2s_controller.rb

INSERT INTO `doc2s` (`tender_id`, `date`, `time`, `venue`, `created_at`, `updated_at`) VALUES (1, '2020-02-16', '11:41:00', 'nvjk', '2020-02-16 11:41:50.089033', '2020-02-16 11:41:50.089033')
---
  def create
    @doc2 = @tender.doc2s.build(doc2_params)

    if @doc2.save

DELETE FROM `doc2s` WHERE `doc2s`.`id` = 1
---
  def destroy
    @doc2.destroy

SELECT `tenders`.* FROM `tenders` WHERE `tenders`.`id` = 1 LIMIT 1
---
    def set_tender
      @tender = Tender.find(params[:tender_id])

SELECT `doc2s`.* FROM `doc2s` WHERE `doc2s`.`tender_id` = 1 AND `doc2s`.`id` = 3 LIMIT 1
SELECT `doc1s`.`id` FROM `doc1s` WHERE `doc1s`.`tender_id` = 1
---
    def set_doc2
      @doc2 = @tender.doc2s.find(params[:id])
      @doc1 = @tender.doc1s.where(id: Doc1.where(tender_id: @tender.id).pluck(:id).join)